programming/switch-statement.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Switch statements from a low-level perspective</title>
<meta name="author" content="8dcc" />
<meta name="generator" content="Org Mode" />
<link rel="icon" type="image/x-icon" href="../img/favicon.png">
<link rel="stylesheet" type="text/css" href="../css/main.css">
</head>
<body>
<div id="content" class="content">
<h1 class="title">Switch statements from a low-level perspective</h1>
<p>
<a href="../index.html">Index</a> | <a href="index.html">Up</a>
</p>

<hr />

<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#introduction">1. Introduction</a></li>
<li><a href="#if-else-blocks">2. If-else blocks</a></li>
<li><a href="#switch-statement">3. Switch statements</a>
<ul>
<li><a href="#simple-switch">3.1. Simple switch</a></li>
<li><a href="#jump-tables">3.2. Jump tables</a></li>
</ul>
</li>
<li><a href="#conclusion">4. Conclusion</a></li>
</ul>
</div>
</div>

<div id="outline-container-introduction" class="outline-2">
<h2 id="introduction"><span class="section-number-2">1.</span> Introduction</h2>
<div class="outline-text-2" id="text-introduction">
<p>
Since I started learning C, I have heard that <code>switch</code> statements are faster and
essentially better than if-else blocks, and that you should use them whenever
possible. I always heard this is because the program jumps to the <code>case</code> label
directly, without checking all previous possibilities one by one.
</p>

<p>
This article was motivated because a friend asked me about <code>switch</code> statements,
and although I have kind of known the reason why they are better for a long
time, I never actually thought about how I would implement the compiler
optimizations myself from assembly. I wrote <a href="https://github.com/8dcc/scratch/blob/d6367ed75cb2e08f5db7301f6dcbb8af847625f6/Assembly/misc/15-switch-statement/jump_table.asm">this code</a>, but I decided to comments
were big enough to turn them into an article.
</p>

<p>
I will to try to explain the following in this article:
</p>

<ol class="org-ol">
<li>How a compiler optimizes <code>switch</code> statements, and how they can be faster than
multiple if-else blocks.</li>
<li>Why the different cases of the <code>switch</code> statement need to be known at compile
time in most programming languages.</li>
</ol>

<p>
Since I am going to explain this from a low-level perspective, you will need a
bit of <code>x86</code> assembly knowledge.
</p>
</div>
</div>

<div id="outline-container-if-else-blocks" class="outline-2">
<h2 id="if-else-blocks"><span class="section-number-2">2.</span> If-else blocks</h2>
<div class="outline-text-2" id="text-if-else-blocks">
<p>
Let's first have a look at a normal if-else conditional.
</p>

<div class="org-src-container">
<pre class="src src-C"><span style="color: #ff6f9f;">if</span> (my_var == <span style="color: #88ca9f;">11</span>) {
    <span style="color: #989898;">/* </span><span style="color: #989898;">Block 1</span><span style="color: #989898;"> */</span>
} <span style="color: #ff6f9f;">else</span> <span style="color: #ff6f9f;">if</span> (my_var == <span style="color: #88ca9f;">12</span>) {
    <span style="color: #989898;">/* </span><span style="color: #989898;">Block 2</span><span style="color: #989898;"> */</span>
} <span style="color: #ff6f9f;">else</span> <span style="color: #ff6f9f;">if</span> (my_var == <span style="color: #88ca9f;">15</span>) {
    <span style="color: #989898;">/* </span><span style="color: #989898;">Block 3</span><span style="color: #989898;"> */</span>
} <span style="color: #ff6f9f;">else</span> {
    <span style="color: #989898;">/* </span><span style="color: #989898;">Block 4</span><span style="color: #989898;"> */</span>
}
</pre>
</div>

<p>
Keep in mind that this is the same as:
</p>

<div class="org-src-container">
<pre class="src src-C"><span style="color: #ff6f9f;">if</span> (my_var == <span style="color: #88ca9f;">11</span>) {
    <span style="color: #989898;">/* </span><span style="color: #989898;">Block 1</span><span style="color: #989898;"> */</span>
} <span style="color: #ff6f9f;">else</span> {
    <span style="color: #ff6f9f;">if</span> (my_var == <span style="color: #88ca9f;">12</span>) {
        <span style="color: #989898;">/* </span><span style="color: #989898;">Block 2</span><span style="color: #989898;"> */</span>
    } <span style="color: #ff6f9f;">else</span> {
        <span style="color: #ff6f9f;">if</span> (my_var == <span style="color: #88ca9f;">15</span>) {
            <span style="color: #989898;">/* </span><span style="color: #989898;">Block 3</span><span style="color: #989898;"> */</span>
        } <span style="color: #ff6f9f;">else</span> {
            <span style="color: #989898;">/* </span><span style="color: #989898;">Block 4</span><span style="color: #989898;"> */</span>
        }
    }
}
</pre>
</div>

<p>
Now let's look at the assembly at a compiler (without optimizations) could have
generated:
</p>

<div class="org-src-container">
<pre class="src src-nasm">    <span style="color: #feacd0;">mov</span> <span style="color: #6ae4b9;">eax</span>, [my_var]

    <span style="color: #feacd0;">cmp</span> <span style="color: #6ae4b9;">eax</span>, <span style="color: #88ca9f;">11</span>
    <span style="color: #feacd0;">jne</span> else_one
    <span style="color: #989898;">; </span><span style="color: #989898;">Block 1...</span>
    <span style="color: #feacd0;">jmp</span> done

<span style="color: #4ae2ff;">else_one</span>:
    <span style="color: #feacd0;">cmp</span> <span style="color: #6ae4b9;">eax</span>, <span style="color: #88ca9f;">12</span>
    <span style="color: #feacd0;">jne</span> else_two
    <span style="color: #989898;">; </span><span style="color: #989898;">Block 2...</span>
    <span style="color: #feacd0;">jmp</span> done

<span style="color: #4ae2ff;">else_two</span>:
    <span style="color: #feacd0;">cmp</span> <span style="color: #6ae4b9;">eax</span>, <span style="color: #88ca9f;">15</span>
    <span style="color: #feacd0;">jne</span> else_three
    <span style="color: #989898;">; </span><span style="color: #989898;">Block 3...</span>
    <span style="color: #feacd0;">jmp</span> done

<span style="color: #4ae2ff;">else_three</span>:
    <span style="color: #989898;">; </span><span style="color: #989898;">Block 4...</span>

<span style="color: #4ae2ff;">done</span>:
    <span style="color: #989898;">; </span><span style="color: #989898;">Continue after conditionals...</span>
</pre>
</div>

<p>
As expected, the conditions are checked sequentially.
</p>
</div>
</div>

<div id="outline-container-switch-statement" class="outline-2">
<h2 id="switch-statement"><span class="section-number-2">3.</span> Switch statements</h2>
<div class="outline-text-2" id="text-switch-statement">
</div>

<div id="outline-container-simple-switch" class="outline-3">
<h3 id="simple-switch"><span class="section-number-3">3.1.</span> Simple switch</h3>
<div class="outline-text-3" id="text-simple-switch">
<p>
Let's look at a <code>switch</code> statement equivalent to the previous if conditionals.
</p>

<div class="org-src-container">
<pre class="src src-C"><span style="color: #ff6f9f;">switch</span> (my_var) {
    <span style="color: #ff6f9f;">case</span> <span style="color: #88ca9f;">11</span>:
        <span style="color: #989898;">/* </span><span style="color: #989898;">Block 1</span><span style="color: #989898;"> */</span>
        <span style="color: #ff6f9f;">break</span>;
    <span style="color: #ff6f9f;">case</span> <span style="color: #88ca9f;">12</span>:
        <span style="color: #989898;">/* </span><span style="color: #989898;">Block 2</span><span style="color: #989898;"> */</span>
        <span style="color: #ff6f9f;">break</span>;
    <span style="color: #ff6f9f;">case</span> <span style="color: #88ca9f;">15</span>:
        <span style="color: #989898;">/* </span><span style="color: #989898;">Block 3</span><span style="color: #989898;"> */</span>
        <span style="color: #ff6f9f;">break</span>;
    <span style="color: #ff6f9f;">default</span>:
        <span style="color: #989898;">/* </span><span style="color: #989898;">Block 4</span><span style="color: #989898;"> */</span>
        <span style="color: #ff6f9f;">break</span>;
}
</pre>
</div>

<p>
For this specific switch statement, since it's pretty small, the compiler might
produce something similar to the previous if-else example:
</p>

<div class="org-src-container">
<pre class="src src-nasm">    <span style="color: #feacd0;">mov</span> <span style="color: #6ae4b9;">eax</span>, [my_var]

    <span style="color: #feacd0;">cmp</span> <span style="color: #6ae4b9;">eax</span>, <span style="color: #88ca9f;">11</span>
    <span style="color: #feacd0;">je</span>  case_11
    <span style="color: #feacd0;">cmp</span> <span style="color: #6ae4b9;">eax</span>, <span style="color: #88ca9f;">12</span>
    <span style="color: #feacd0;">je</span>  case_12
    <span style="color: #feacd0;">cmp</span> <span style="color: #6ae4b9;">eax</span>, <span style="color: #88ca9f;">15</span>
    <span style="color: #feacd0;">je</span>  case_15
    <span style="color: #feacd0;">jmp</span> case_default

<span style="color: #4ae2ff;">case_11</span>:
    <span style="color: #989898;">; </span><span style="color: #989898;">Block 1...</span>
    <span style="color: #feacd0;">jmp</span> done

<span style="color: #4ae2ff;">case_12</span>:
    <span style="color: #989898;">; </span><span style="color: #989898;">Block 2...</span>
    <span style="color: #feacd0;">jmp</span> done

<span style="color: #4ae2ff;">case_15</span>:
    <span style="color: #989898;">; </span><span style="color: #989898;">Block 3...</span>
    <span style="color: #feacd0;">jmp</span> done

<span style="color: #4ae2ff;">case_default</span>:
    <span style="color: #989898;">; </span><span style="color: #989898;">Block 4...</span>

<span style="color: #4ae2ff;">done</span>:
    <span style="color: #989898;">; </span><span style="color: #989898;">Continue after conditionals...</span>
</pre>
</div>

<p>
However, if there are a lot of switch statements, and they are not too apart
from each other, the compiler will probably use a <b>jump table</b>.
</p>
</div>
</div>

<div id="outline-container-jump-tables" class="outline-3">
<h3 id="jump-tables"><span class="section-number-3">3.2.</span> Jump tables</h3>
<div class="outline-text-3" id="text-jump-tables">
<p>
The idea behind the jump table is using the value of <code>my_var</code> as an <b>index</b> in an
array of pointers (the jump table). Each element in the jump table will contain
the address of a procedure corresponding to the label of the <code>switch</code>.
</p>

<p>
The assembly needs to do the following:
</p>

<ol class="org-ol">
<li>Define the jump table, in our case in the <code>.data</code> section.</li>
<li>In the location of the <code>switch</code>, somehow convert the value inside <code>my_var</code> to the
index of the jump table, and jump to the stored address at that index (more
on this below).</li>
<li>After the jump instruction, add a "done" label that each <code>case</code> will use for
returning.</li>
<li>Define the <code>case</code> labels somewhere in the <code>.text</code> section, with the blocks that
the user defined in the <code>switch</code>. At the end of the blocks, jump to the "done"
label that we declared inside the main function.</li>
</ol>

<p>
For example:
</p>

<div class="org-src-container">
<pre class="src src-nasm"><span style="color: #ff6f9f;">section</span> <span style="color: #79a8ff;">.data</span>
<span style="color: #4ae2ff;">jump_table</span>:
    <span style="color: #989898;">; </span><span style="color: #cabf00; font-weight: bold;">TODO:</span><span style="color: #989898;"> Handle cases smaller than 11</span>
    <span style="color: #feacd0;">dq</span> case_11
    <span style="color: #feacd0;">dq</span> case_12
    <span style="color: #feacd0;">dq</span> case_default <span style="color: #989898;">; </span><span style="color: #989898;">case 13, not specified</span>
    <span style="color: #feacd0;">dq</span> case_default <span style="color: #989898;">; </span><span style="color: #989898;">case 14, not specified</span>
    <span style="color: #feacd0;">dq</span> case_15
    <span style="color: #989898;">; </span><span style="color: #cabf00; font-weight: bold;">TODO:</span><span style="color: #989898;"> Handle cases greater than 15</span>

<span style="color: #989898;">; </span><span style="color: #989898;">------------------------------------------------------------------------------</span>

<span style="color: #ff6f9f;">section</span> <span style="color: #79a8ff;">.text</span>
<span style="color: #4ae2ff;">my_func</span>:
    <span style="color: #989898;">; </span><span style="color: #989898;">Code before the switch...</span>

    <span style="color: #feacd0;">mov</span> <span style="color: #6ae4b9;">eax</span>, [my_var]

    <span style="color: #989898;">; </span><span style="color: #cabf00; font-weight: bold;">TODO:</span><span style="color: #989898;"> Get index in the jump table from the value in `eax'</span>
    <span style="color: #feacd0;">jmp</span> ???

<span style="color: #4ae2ff;">.switch_done</span>:
    <span style="color: #989898;">; </span><span style="color: #989898;">Code after the switch...</span>
    <span style="color: #feacd0;">ret</span>

<span style="color: #989898;">; </span><span style="color: #989898;">------------------------------------------------------------------------------</span>

<span style="color: #4ae2ff;">case_11</span>:
    <span style="color: #989898;">; </span><span style="color: #989898;">Block 1...</span>
    <span style="color: #feacd0;">jmp</span> my_func.switch_done

<span style="color: #4ae2ff;">case_12</span>:
    <span style="color: #989898;">; </span><span style="color: #989898;">Block 2...</span>
    <span style="color: #feacd0;">jmp</span> my_func.switch_done

<span style="color: #4ae2ff;">case_15</span>:
    <span style="color: #989898;">; </span><span style="color: #989898;">Block 3...</span>
    <span style="color: #feacd0;">jmp</span> my_func.switch_done

<span style="color: #4ae2ff;">case_default</span>:
    <span style="color: #989898;">; </span><span style="color: #989898;">Block 4...</span>
    <span style="color: #feacd0;">jmp</span> my_func.switch_done
</pre>
</div>

<p>
The addresses of all those <code>case_*</code> labels at the bottom will be stored in the
jump table inside the <code>.data</code> section. Since this is <code>x86_64</code> assembly, each element
of the jump table is a <i>quad-word</i> because it needs to be able to hold these
64-bit addresses. For 32-bits, we would use <code>dd</code> for declaring a 32-bit
<i>double-word</i>.
</p>

<p>
Note how the third and fourth elements in the jump table correspond to the 13
and 14 values that the user did not specify in the <code>switch</code> statement. Since they
are just two, we can fill them with the address of the <code>case_default</code> label.
</p>

<p>
As you can see, the only thing left is making sure the value is within the first
and last element of the array, and then calculating the index in the array from
there.
</p>

<p>
The first part is simple, just compare <code>eax</code> against the value of the lowest and
biggest <code>case</code> values. If it's not within those bounds, jump to the <code>case_default</code>
label.
</p>

<div class="org-src-container">
<pre class="src src-nasm"><span style="color: #989898;">; </span><span style="color: #989898;">if (eax &lt; 11 || eax &gt; 15)</span>
<span style="color: #989898;">;     </span><span style="color: #989898;">goto case_default</span>
<span style="color: #feacd0;">cmp</span> <span style="color: #6ae4b9;">eax</span>, <span style="color: #88ca9f;">11</span>
<span style="color: #feacd0;">jl</span>  case_default
<span style="color: #feacd0;">cmp</span> <span style="color: #6ae4b9;">eax</span>, <span style="color: #88ca9f;">15</span>
<span style="color: #feacd0;">jg</span>  case_default
</pre>
</div>

<p>
To calculate the index in the array, we simply subtract the value of the lowest
<code>case</code> (in this case 11) to the value in <code>my_var</code>. However, we also need to multiply
this index by the size of each element in <code>jump_table</code> (in this case 8-byte
<i>quad-words</i>) to get the real offset. For example:
</p>

<div class="org-src-container">
<pre class="src src-nasm"><span style="color: #989898;">; </span><span style="color: #989898;">Subtract the lowest case</span>
<span style="color: #feacd0;">sub</span>  <span style="color: #6ae4b9;">eax</span>, <span style="color: #88ca9f;">11</span>

<span style="color: #989898;">; </span><span style="color: #989898;">Multiply by 8 (quad-word) to get the byte offset</span>
<span style="color: #feacd0;">imul</span> <span style="color: #6ae4b9;">eax</span>, <span style="color: #6ae4b9;">eax</span>, <span style="color: #88ca9f;">8</span>

<span style="color: #989898;">; </span><span style="color: #989898;">Store the address of the jump table</span>
<span style="color: #feacd0;">mov</span>  <span style="color: #6ae4b9;">rdx</span>, jump_table

<span style="color: #989898;">; </span><span style="color: #989898;">Add the byte offset to the address, and dereference it to get the address of</span>
<span style="color: #989898;">; </span><span style="color: #989898;">this `case'</span>
<span style="color: #feacd0;">mov</span>  <span style="color: #6ae4b9;">rdx</span>, [<span style="color: #6ae4b9;">rdx</span>]

<span style="color: #989898;">; </span><span style="color: #989898;">Jump to the label itself</span>
<span style="color: #feacd0;">jmp</span>  <span style="color: #6ae4b9;">rdx</span>
</pre>
</div>

<p>
If you are actually going to try this code, you might want to use <code>lea</code> when
loading the address of <code>jump_table</code>. For more information, see my note in
<a href="../reversing/understanding-call-stack.html#note-about-position-independent-executables">Understanding and traversing the call stack</a>.
</p>

<p>
In this case, I used the <code>imul</code> instruction, which multiplies the second operand
by the third operand and saves the result in the first operand. Since we are
multiplying by 8 (a power of 2) we could have used a more optimal bit shift:
</p>

<div class="org-src-container">
<pre class="src src-nasm"><span style="color: #feacd0;">imul</span> <span style="color: #6ae4b9;">rax</span>, <span style="color: #6ae4b9;">rax</span>, <span style="color: #88ca9f;">8</span>
<span style="color: #989898;">; </span><span style="color: #989898;">The same as:</span>
<span style="color: #feacd0;">shl</span>  <span style="color: #6ae4b9;">rax</span>, <span style="color: #88ca9f;">3</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-conclusion" class="outline-2">
<h2 id="conclusion"><span class="section-number-2">4.</span> Conclusion</h2>
<div class="outline-text-2" id="text-conclusion">
<p>
The compiler doesn't always use a jump table for <code>switch</code> statements, because if
the values are too separated from each other, the array would be too big and it
wouldn't be worth it. If the jump table is too small, the compiler might also
decide to treat the <code>switch</code> as a series of nested <code>if-else</code> blocks, just like we
saw before.
</p>

<p>
With this in mind, it's more clear why the values in the <code>case</code> statements have to
be <b>known at compile time</b>. The compiler needs to know the specific values of all
the cases just to decide if it's worth it to generate a jump table. Then, it
also uses them for filling default cases, making sure the value is between the
lowest and greatest values, for indexing, etc.
</p>

<p>
If you reached this far, I hope you learned something. For the full source code,
see my <a href="https://github.com/8dcc/scratch/blob/d6367ed75cb2e08f5db7301f6dcbb8af847625f6/Assembly/misc/15-switch-statement/jump_table.asm">scratch repository</a>.
</p>
</div>
</div>
</div>
</body>
</html>
